title: Alibaba Cloud
description: A whois rule for Alibaba Cloud
contact:
  provider: Alibaba Cloud
  address: https://www.alibabacloud.com/report#abuse
detection:
  selection:
    rawText|contains:
      - Alibaba Cloud Computing Ltd. d/b/a HiChina (www.net.cn)
      - 阿里云计算有限公司
      - domainabuse@service.aliyun.com
      - www.alibabacloud.com
  condition: selection
logsource:
  product: abuse_whois
