title: Hostinger
description: A whois rule for Hostinger
contact:
  provider: Hostinger
  address: abuse@hostinger.com
detection:
  selection:
    rawText|contains:
      - "Registrar URL: https://www.hostinger.com"
      - "abuse@hostinger.com"
  condition: selection
logsource:
  product: abuse_whois
