title: Namecheap
description: A whois rule for Namecheap
contact:
  provider: Namecheap
  address: https://support.namecheap.com/index.php?/Tickets/Submit
detection:
  selection:
    rawText|contains:
      - abuse@namecheap.com
  condition: selection
logsource:
  product: abuse_whois
