id: whois-namecheap
title: Namecheap
description: A whois rule for Namecheap
contact:
  provider: Namecheap
  address: abuse@namecheap.com
detection:
  selection:
    rawText|contains:
      - abuse@namecheap.com
  condition: selection
logsource:
  product: abuse_whois
