title: Orange
description: A whois rule for Orange
contact:
  provider: Orange
  address: abuse-dept@orangewebsite.com
detection:
  selection:
    rawText|contains:
      - abuse@orangewebsite.com
  condition: selection
logsource:
  product: abuse_whois
