title: PublicDomainRegistry
description: A whois rule for PublicDomainRegistry
contact:
  provider: PublicDomainRegistry
  address: https://publicdomainregistry.com/process-for-handling-abuse/
detection:
  selection:
    rawText|contains:
      - abuse-contact@publicdomainregistry.com
  condition: selection
logsource:
  product: abuse_whois
