title: Registrar.eu
description: A whois rule for Registrar.eu
contact:
  provider: Registrar.eu
  address: https://abuse.registrar.eu
detection:
  selection:
    rawText|contains:
      - abuse@registrar.eu
  condition: selection
logsource:
  product: abuse_whois
