title: 000webhost
description: A shard hosting rule for 000webhost
contact:
  provider: 000webhost
  address: https://www.000webhost.com/report-abuse
detection:
  selection:
    domain|endswith:
      - .000webhost.com
      - .000webhostapp.com
  condition: selection
logsource:
  product: abuse_whois
