title: Backblaze
description: A shard hosting rule for Backblaze
contact:
  provider: Backblaze
  address: reportphishing@backblaze.com
detection:
  selection:
    domain|endswith:
      - .backblazeb2.com
  condition: selection
logsource:
  product: abuse_whois
