title: ChangeIP
description: A shard hosting rule for ChangeIP
contact:
  provider: ChangeIP
  address: https://www.changeip.com/contact-us.php
detection:
  selection:
    domain|endswith:
      - .wikaba.com
      - .zzux.com
      - .dumb1.com
      - .onedumb.com
      - .youdontcare.com
      - .yourtrap.com
      - .2waky.com
      - .sexidude.com
      - .mefound.com
      - .organiccrap.com
      - .toythieves.com
      - .justdied.com
      - .jungleheart.com
      - .mrbasic.com
      - .mrbonus.com
      - .x24hr.com
      - .dns04.com
      - .dns05.com
      - .zyns.com
      - .my03.com
      - .fartit.com
      - .itemdb.com
      - .instanthq.com
      - .xxuz.com
      - .jkub.com
      - .itsaol.com
      - .faqserv.com
      - .jetos.com
      - .qpoe.com
      - .qhigh.com
      - .vizvaz.com
      - .mrface.com
      - .isasecret.com
      - .mrslove.com
      - .otzo.com
      - .americanunfinished.com
      - .serveusers.com
      - .serveuser.com
      - .freetcp.com
      - .ddns.info
      - .ns01.info
      - .ns02.info
      - .myftp.info
      - .mydad.info
      - .mymom.info
      - .mypicture.info
      - .myz.info
      - .squirly.info
      - .toh.info
      - .xxxy.info
      - .freewww.info
      - .freeddns.com
      - .myddns.com
      - .dynamicdns.biz
      - .ns01.biz
      - .ns02.biz
      - .xxxy.biz
      - .sexxxy.biz
      - .freewww.biz
      - .www1.biz
      - .dhcp.biz
      - .edns.biz
      - .ftp1.biz
      - .mywww.biz
      - .gr8domain.biz
      - .gr8name.biz
      - .ftpserver.biz
      - .wwwhost.biz
      - .moneyhome.biz
      - .port25.biz
      - .esmtp.biz
      - .dsmtp.biz
      - .sixth.biz
      - .ninth.biz
      - .misecure.com
      - .got-game.org
      - .bigmoney.biz
      - .dns2.us
      - .dns1.us
      - .ns02.us
      - .ns01.us
      - .changeip.us
      - .changeip.biz
      - .almostmy.com
      - .ocry.com
      - .ourhobby.com
      - .dnsfailover.net
      - .ygto.com
      - .ddns.ms
      - .ddns.us
      - .gettrials.com
      - .25u.com
      - .4dq.com
      - .4pu.com
      - .3-a.net
      - .dsmtp.com
      - .dsmtp.com
      - .mynumber.org
      - .ns1.name
      - .ns2.name
      - .ns3.name
      - .rebatesrule.net
      - .ezua.com
      - .sendsmtp.com
      - .ssmailer.com
      - .trickip.net
      - .trickip.org
      - .dnsrd.com
      - .lflinkup.com
      - .lflinkup.net
      - .lflinkup.org
      - .lflink.com
      - .dns-dns.com
      - .b0tnet.com
      - .proxydns.com
      - .changeip.net
      - .mysecondarydns.com
      - .changeip.org
      - .dns-stuff.com
      - .dynssl.com
      - .mylftv.com
      - .mynetav.com
      - .mynetav.net
      - .mynetav.org
      - .dns-report.com
      - .homingbeacon.net
      - .ikwb.com
      - .acmetoy.com
      - .ddns.mobi
      - .dnset.com
      - .as19557.net
      - .toshibanetcam.com
      - .authorizeddns.net
      - .authorizeddns.org
      - .authorizeddns.us
      - .cleansite.biz
      - .cleansite.info
      - .cleansite.us
      - .https443.net
      - .https443.org
      - .mypop3.net
      - .mypop3.org
      - .ssl443.org
      - .iownyour.biz
      - .iownyour.org
      - .onmypc.biz
      - .onmypc.info
      - .onmypc.net
      - .onmypc.org
      - .onmypc.us
      - .dubya.info
      - .dubya.us
      - .dubya.biz
      - .dubya.net
      - .changeip.co
      - .wwwhost.us
  condition: selection
logsource:
  product: abuse_whois
