title: Glitch
description: A shard hosting rule for Glitch
contact:
  provider: Glitch
  address: support@glitch.com
detection:
  selection:
    domain|endswith:
      - .glitch.me
      - .glitch.com
  condition: selection
logsource:
  product: abuse_whois
