title: Jimdo
description: A shard hosting rule for Jimdo
contact:
  provider: Jimdo
  address: https://jimdo-legal.zendesk.com/hc/en-us/requests/new?ticket_form_id=239123
detection:
  selection:
    domain|endswith:
      - .jimdosite.com
  condition: selection
logsource:
  product: abuse_whois
