title: Notion
description: A shard hosting rule for Notion
contact:
  provider: Notion
  address: https://www.notion.so/Report-inappropriate-content-9feb9f2f9d8c40b1b7d289b155907de0
detection:
  selection:
    domain|endswith:
      - .notion.so
      - .notion.com
      - notion.so
      - notion.com
  condition: selection
logsource:
  product: abuse_whois
