title: WordPress
description: A shared hosting rule for WordPress
contact:
  provider: WordPress
  address: https://wordpress.com/abuse/
detection:
  selection:
    domain|endswith:
      - .wordpress.com
  condition: selection
logsource:
  product: abuse_whois
