title: Yola
description: A shared hosting rule for Yola
contact:
  provider: Yola
  address: https://helpcenter.yola.com/hc/en-us/requests/new?ticket_form_id=360001504300
base_domains: # ref: https://www.yola.com/features/domains
detection:
  selection:
    domain|endswith: # ref: https://www.yola.com/features/domains
      - .yolasite.com
  condition: selection
logsource:
  product: abuse_whois
