id: whois-namesilo
title: Namesilo
description: A whois rule for Namesilo
contact:
  provider: Namesilo
  address: https://example.com
detection:
  selection:
    rawText|contains:
      - abuse@namesilo.com
  condition: selection
logsource:
  product: abuse_whois
